# -*- coding: cp1251 -*-

# Задача 1. Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d. Каждое число вводится с новой строки.

#n = int(input('Введите первый элемент : '))
#a = int(input('Введите разность: '))
#d = int(input('Введите количество элементов: '))
#res = []

#for i in range(d):
#	res.append(n)
#	n += a

#print(*res)