# -*- coding: cp1251 -*-

#Задача 2: Найдите сумму цифр трехзначного числа.

number = input('Введите трёхзначное число: ')
print(f'Сумма цифр числа равна: {int(number[0]) + int(number[1]) + int(number[2])}')