{
	"Овен": "Сегодня Овны могут ликовать – настал тот самый день, когда можно начинать что-то новое, уходить с головой в авантюры и идти навстречу приключениям. Вас ожидает много ярких эмоций и неизгладимых впечатлений. Гороскоп на сегодня для знака Овна советует рискнуть и показать конкурентам, где раки зимуют. Вы добьетесь своего легко и просто. Главное – настраиваться на лучшее.",
	"Телец": "Сегодня Тельцам стоит быть мобильнее и активнее в разговорах – это отличный день, чтобы показать себя, свои таланты. Вам просто необходимо небольшое путешествие, и запланировать его полезно уже сейчас, чтобы осуществить в ближайшее время. Гороскоп на сегодня для знака Тельца советует довести долгоиграющие задачи до конца – сейчас у вас получится завершить их легко и просто.",
	"Близнецы": "Сегодня Близнецам стоит чаще прислушиваться к логике, чем к шестому чувству. Не доверяйте импульсам – под их давлением вы можете наломать дров. Очень важно говорить свое личное мнение и делиться планами – найдутся люди, которые вас точно поддержат. Гороскоп на сегодня для знака Близнецов советует общаться исключительно с близкими – незнакомцы в этот день могут принести неприятности.",
	"Рак": "Сегодня Ракам стоит больше общаться с самыми разными людьми. Даже те, кто вам не нравится, могут принести хорошие новости. Только останавливайте разговоры, если чувствуете негатив – не стоит ждать скандала. Гороскоп на сегодня для знака Рака советует много работать – будет шанс заработать кругленькую сумму или выбить себе новую должность.",
	"Лев": "Сегодня Львам будет непросто – проблемы и неприятности будут встречаться на каждом шагу. Но у вас хватит сил и ума с ними справиться быстро и легко. Придется провести работу над ошибками – это поможет вам расправить крылья и нестись навстречу целям. Гороскоп на сегодня для знака Льва советует стартануть в чем-то – это обязательно приведет вас к успеху.",
	"Дева": "Сегодня Девы не должны сидеть на месте. Активность и инициативность привлечет к ним новых и очень важных людей. Да и дела пойдут в гору. Не все будет четко идти по плану – некоторые неприятности могут испортить настроение. Но вы со всем справитесь, если не будете унывать. Гороскоп на сегодня для знака Девы советует запланировать деловые переговоры – вы найдете компромисс.",
	"Весы": "Сегодня Весы будут на коне. У вас получается абсолютно все, за что вы беретесь. От этого самооценка поползет вверх, а это поможет поверить в свои силы и взяться за что-то масштабное. Ваш путь будет усеян знаками, которые могут помочь во многих вопросах, главное – расшифровывать их правильно, а в этом подсобит интуиция. Гороскоп на сегодня для знака Весов советует фантазировать – это поможет и в работе, и в личной жизни.",
	"Скорпион": "Сегодня Скорпионам захочется полениться, и звезды дают добро – этот выходной вы можете провести так, как вам давно хотелось. О работе лучше даже не думать – расслабьтесь полностью. Звезды пошлют вам приятные сюрпризы, которые поднимут ваше настроение до небес. Гороскоп на сегодня для знака Скорпиона советует провести вечер с огоньком – сходите куда-нибудь, развейтесь.",
	"Стрелец": "Сегодня Стрельцам стоит расслабиться. Вообще, звезды советуют этот выходной провести дома со своими близкими. Также неплохо подумать о своем здоровье – прислушайтесь к своему организму, он подскажет, на чем акцентировать внимание. Гороскоп на сегодня для знака Стрельца советует говорить о деньгах больше – сейчас вам необходимо притянуть к себе финансовую энергию.",
	"Козерог": "Сегодня Козерогов хлебом не корми, дай поработать. Но звезды против такого рвения – это все же выходной день. Лучше занимайтесь домашними хлопотами и общайтесь с близкими – ваше внимание им будет очень важно. Гороскоп на сегодня для знака Козерога советует чаще помогать окружающим – можете укрепить свою карму. Вечером устройте романтический сюрприз – порадуйте вторую половинку.",
	"Водолей": "Сегодня Водолеям не просто можно, а даже нужно мечтать – это поможет отдохнуть от реальности, перезагрузиться. Случайности будут неслучайны – вы можете встретить особенного человека или услышать важные новости. И то, и другое изменит привычный ход дел. Гороскоп на сегодня для знака Водолея советует в этот вечер не выходить из дома, провести больше времени с близкими.",
	"Рыбы": "Сегодня Рыбам стоит быть ближе к любимым – помогайте им, общайтесь с ними. А вот что не нужно делать, так это давать советы – они могут работать в вашей жизни, но для других станут вредными. Ходить по магазинам не просто можно, а даже нужно – сейчас стоит порадовать себя покупками, вы это заслужили. Гороскоп на сегодня для знака Рыб обещает вам интересные новости, которые обязательно изменят ваше будущее."
}