# -*- coding: cp1251 -*-

# Задача 1. Строка представляет собой арифметическое выражение из однозначных чисел и знаков + и -. Вычислите результат.

#try:
#    while True:
#        print(eval(input('Введите значение: ')))
#except:
#    print('Good bye')

# Задача 2. Словом в данной задаче считается последовательность букв, ограниченная пробелами или началом или концом строки. 
# Выведите все слова из строки в столбик. НЕЛЬЗЯ ПОЛЬЗОВАТЬСЯ МЕТОДАМИ СТРОК (split)

#text = input('Введите текст: ')
#words = ''

#for i in range(len(text)):
#	if text[i] == ' ':
#		print(words)
#		words = ''
#	else:
#		words += text[i]

#print(words)

#text = input('Введите текст: ')
#print(*text.split(), sep = '\n')