# -*- coding: cp1251 -*-

# Задача 1. Строка представляет собой арифметическое выражение из однозначных чисел и знаков + и -. Вычислите результат.

#try:
#    while True:
#        print(eval(input('Введите значение: ')))
#except:
#    print('Good bye')

