# -*- coding: cp1251 -*-

# Задача 1. По данному целому неотрицательному n вычислите значение n!. N! = 1 * 2 * 3 * ... * N 
# (произведение всех чисел от 1 до N) 0! = 1. Решить задачу используя цикл while. 
# Задача 2. Дано натуральное число А > 1. Определите, каким по счету числом Фибоначчи оно является,
# то есть выведите такое число n, что ф(n) = А. Если А не является числом Фибоначчи, выведите число -1.

# Task 1

n = int(input('Введите целое неотрицательное число: '))
print(n)