# -*- coding: cp1251 -*-

# Задача 1. Напишите программу, которая принимает на вход строку, и отслеживает кол-во повторов каждого символа.

#string = input('Введите строку: ')
#comp = set()

#for i in range(len(string)):
#	if string[i] not in comp:
#		print(f'"{string[i]}" - {string.count(string[i])}')
#		comp.add(string[i])

# Задача 2. Пользователь вводит текст(строка). Словом считается последовательность непробельных символов идущих подряд, слова разделены одним или большим числом пробелов или символами конца строки. Определите, сколько различных слов содержится в этом тексте.

#a = 'слова считаются словами если. мы правы! слова если'
#words = set()
#word = ''

#for i in a:
#	if i not in {' ', '.','!', '?'}:
#		word += i
#	else:
#		if word != '':
#			words.add(word)
#		word = ''
#print(len(words))

