# -*- coding: cp1251 -*-

# Задача 1. Даны два массива чисел. Требуется вывести те элементы первого массива 
# (в том порядке, в каком они идут в первом массиве), которых нет во втором массиве. 
# Пользователь вводит число N - количество элементов в первом массиве, затем 
# N чисел - элементы массива. Затем число M - количество элементов во втором массиве. 
# Затем элементы второго массива

#import random

#list_1 = [random.randint(1, 100)for i in range(int(input("Введите длину первого списка: ")))]
#list_2 = {random.randint(1, 100)for i in range(int(input("Введите длину второго списка: ")))}
#list_3 = []

#print(*list_1)
#print(*list_2)

#for i in list_1:
#	if i not in list_2:
#		list_3.append(i)

#print(*list_3)